## 데이터 조작

In [1]:
import numpy as np 
import pandas as pd

### 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [3]:
s.count()

9

In [4]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [5]:
df.count()      # axis=0 가 디폴트

0    4
1    4
2    4
3    3
dtype: int64

In [6]:
df.count(axis=1)

0    4
1    4
2    3
3    4
dtype: int64

In [7]:
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [9]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

### 카테고리 값 세기

In [11]:
vec = np.random.randint(6, size=100)
s2 = pd.Series(vec)
s2.tail()

95    5
96    4
97    5
98    2
99    5
dtype: int32

In [12]:
s2.value_counts()

3    20
5    19
1    17
0    16
2    14
4    14
dtype: int64

In [13]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [14]:
titanic['sibsp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: sibsp, dtype: int64

### 정렬

In [15]:
s2.value_counts().sort_index()

0    16
1    17
2    14
3    20
4    14
5    19
dtype: int64

In [16]:
s.sort_values()     # ascending=True 가 디폴트

0    0.0
1    1.0
2    2.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
3    NaN
dtype: float64

In [17]:
s.sort_values(ascending=False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [19]:
df = pd.DataFrame(np.random.rand(16).reshape(4,4))
df

          0         1         2         3
0  0.229574  0.704627  0.087563  0.030589
1  0.357135  0.589782  0.052223  0.065664
2  0.043501  0.395151  0.668427  0.198027
3  0.876266  0.432389  0.619641  0.290427

In [20]:
df.sort_values(by=1)

          0         1         2         3
2  0.043501  0.395151  0.668427  0.198027
3  0.876266  0.432389  0.619641  0.290427
1  0.357135  0.589782  0.052223  0.065664
0  0.229574  0.704627  0.087563  0.030589

In [21]:
df

          0         1         2         3
0  0.229574  0.704627  0.087563  0.030589
1  0.357135  0.589782  0.052223  0.065664
2  0.043501  0.395151  0.668427  0.198027
3  0.876266  0.432389  0.619641  0.290427

### 행/열 합계

In [22]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [23]:
df2.sum()       # axis=0 이 디폴트

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [24]:
df2.sum(axis=1)

0    35
1    34
2    41
3    42
dtype: int64

In [25]:
df2['행의 합'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  행의 합
0  5  8  9  5  0  0  1  7    35
1  6  9  2  4  5  2  4  2    34
2  4  7  7  9  1  7  0  6    41
3  9  9  7  6  9  1  0  1    42

In [26]:
df2.loc['열의 합', :] = df2.sum()
df2

         0     1     2     3     4     5    6     7   행의 합
0      5.0   8.0   9.0   5.0   0.0   0.0  1.0   7.0   35.0
1      6.0   9.0   2.0   4.0   5.0   2.0  4.0   2.0   34.0
2      4.0   7.0   7.0   9.0   1.0   7.0  0.0   6.0   41.0
3      9.0   9.0   7.0   6.0   9.0   1.0  0.0   1.0   42.0
열의 합  24.0  33.0  25.0  24.0  15.0  10.0  5.0  16.0  152.0

### 연습문제
- 1) 타이타닉호 승객의 평균 나이
- 2) 타이타닉호 승객중 여성 승객의 평균 나이
- 3) 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이

In [29]:
# 1)
round(titanic['age'].mean(), 2)

29.7

In [31]:
# 2)
t2 = titanic[titanic['sex'] == 'female']
round(t2['age'].mean(), 2)

27.92

In [32]:
# 3)
t3 = titanic[(titanic['class'] == 'First') & (titanic['sex'] == 'female')]
round(t3['age'].mean(), 2)

34.61

### apply 변환

In [33]:
x, y = map(int, input('정수 2개 입력> ').split())

In [34]:
x, y

(10, 20)

In [35]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [36]:
def diff(x):            # x 는 Series type
    return x.max() - x.min()

In [38]:
df3.apply(diff)

A    3
B    2
C    4
dtype: int64

In [39]:
df3.apply(lambda x: x.max() - x.min())

A    3
B    2
C    4
dtype: int64

In [40]:
df3.apply(lambda x: x.max() - x.min(), axis=1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [44]:
titanic['adult/child'] = titanic.apply(lambda r: 'adult' if r.age >= 20 else 'child', axis=1)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

### fillna() method

In [45]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [46]:
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### astype() method

In [47]:
df3.apply(pd.value_counts).fillna(0.0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [49]:
# 연습문제 4.4.6
titanic['age'] = titanic['age'].fillna(0)
titanic['category2'] = titanic['sex'] + titanic['age'].astype(int).astype(str)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male22
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female38
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female26
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female35
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male35